M_LOC = [];

M_LOC[1] = "禮敬那位世尊、阿羅漢、遍正覺者";
M_LOC[2] = "長部";
M_LOC[4] = "一、戒蘊品";
M_LOC[6] = "梵網經";
M_LOC[7] = "遊行者之說";
M_LOC[8] = "我聽到這樣：
　　有一次，世尊與五百位比丘的大比丘僧團一起在王舍城與那爛陀中間的旅途中。遊行者善愛與徒弟梵施學生婆羅門一起也在王舍城與那爛陀中間的旅途中。在那裡，遊行者善愛以種種法門不稱讚佛陀、不稱讚法、不稱讚僧團，但，遊行者善愛的徒弟梵施學生婆羅門以種種法門稱讚佛陀、稱讚法、稱讚僧團，像這樣，那師徒兩人相互以直接反對之語緊隨在世尊與比丘僧團後面。(1)";
M_LOC[9] = "那時，世尊與比丘僧團一起走進芒果樹苖圃中的皇家休憩小屋過夜，遊行者善愛與徒弟梵施學生婆羅門也走進芒果樹苖圃中的皇家休憩小屋過夜，在那裡，遊行者善愛以種種法門不稱讚佛陀、不稱讚法、不稱讚僧團，但，遊行者善愛的徒弟梵施學生婆羅門以種種法門稱讚佛陀、稱讚法、稱讚僧團，像這樣，那師徒兩人相互以直接反對之語而住。(2)";
M_LOC[10] = "那時，眾多比丘在夜破曉時起來，在圓形帳蓬集會共坐，出現這樣的話題：
　　「不可思議啊，學友們！未曾有啊，學友們！直到此，眾生的不同志向之狀態被那有知、有見的世尊、阿羅漢、遍正覺者善知，這位遊行者善愛以種種法門不稱讚佛陀、不稱讚法、不稱讚僧團，但，遊行者善愛的徒弟梵施學生婆羅門以種種法門稱讚佛陀、稱讚法、稱讚僧團，像這樣，這師徒兩人相互以直接反對之語緊隨在世尊與比丘僧團後面。」(3)";
M_LOC[220] = "沙門果經";
M_LOC[221] = "國王大臣的談論";
M_LOC[222] = "我聽到這樣：
　　有一次，世尊與一千二百五十位比丘的大比丘僧團一起住在王舍城養子耆婆的芒果園中。
　　當時，在那第四個月的迦刺底迦月滿月日，十五布薩日的滿月夜晚，摩揭陀國阿闍世王韋提希子被大臣們圍繞著，到最高樓上坐下。那時，摩揭陀國阿闍世王韋提希子在布薩日自說優陀那：
　　「先生！明月的夜晚確實是愉快的，先生！明月的夜晚確實是殊妙的，先生！明月的夜晚確實是好看的，先生！明月的夜晚確實是清淨的，先生！明月的夜晚確實是祥瑞的，現在，我們應該訪問哪位沙門、婆羅門，當親近他們時，我們的心能被淨化呢？」(150)";
M_LOC[223] = "當這麼說時，某位大臣對摩揭陀國阿闍世王韋提希子這麼說：
　　「陛下！這位富蘭那迦葉有眾多追隨者，一群人之首，一群人的老師，有名聲的知名開宗祖師，眾人公認的有德行者、有經驗者、長久出家者，年邁，已到了老人期，陛下！請親近那位富蘭那迦葉，或許當親近富蘭那迦葉時，陛下的心能被淨化。」當這麼說時，摩揭陀國阿闍世王韋提希子變得沉默。(151)";
M_LOC[224] = "另一位大臣也對摩揭陀國阿闍世王韋提希子這麼說：
　　「陛下！這位末迦利瞿舍羅有眾多追隨者，一群人之首，一群人的老師，有名聲的知名開宗祖師，眾人公認的有德行者、有經驗者、長久出家者，年邁，已到了老人期，陛下！請親近那位末迦利瞿舍羅，或許當親近末迦利瞿舍羅時，陛下的心能被淨化。」當這麼說時，摩揭陀國阿闍世王韋提希子變得沉默。(152)";
